"""Создайте программу Python для интернет-магазина, состоящую из двух основных классов: CustomerManager и
ProductInventory. Класс CustomerManager должен отвечать за обработку операций, связанных с клиентами,
таких как добавление новых клиентов, обновление информации о клиентах и получение данных о клиентах. Он должен иметь
такие методы, как add_customer(), update_customer() и get_customer(). Класс ProductInventory должен отвечать за
управление запасами товаров в магазине. Он должен обрабатывать такие операции, как добавление продуктов, обновление
информации о продукте и получение сведений о продукте. Он должен иметь такие методы, как add_product(),
update_product() и get_product(). Разделяя управление клиентами и запасами продуктов на отдельные классы,
вы гарантируете, что каждый класс несет единую ответственность, делая программу более модульной и простой в
обслуживании."""
