"""Создайте программу Python, определяющую иерархию классов для различных геометрических фигур, таких как Shape,
Circle, Rectangle и Triangle. Класс Shape должен служить базовым классом, предоставляя общие свойства и методы для
всех фигур. Каждый конкретный класс формы (Circle, Rectangle, Triangle) должен наследоваться от Shape и реализовывать
свои собственные методы, такие как calculate_area() и calculate_perimeter(). Программа должна позволять вам
рассматривать любую фигуру как экземпляр класса Shape, обеспечивая соблюдение принципа подстановки Лисков. Это
означает, что вы должны иметь возможность заменить любую конкретную фигуру объектом Shape в любой части программы,
не влияя на её выполнение. Разрабатывая иерархию классов в соответствии с принципом замещения Лискова, вы создаете
систему, которая является более гибкой, расширяемой и способной единообразно обрабатывать операции, связанные с
формами."""